Autodesk.Revit.DB.FailureDefinitionRegistry.ListAllFailureDefinitions
Retrieves all the registered FailureDefinitions.
Returns:
All the registered FailureDefinitions.
Since:
2011

Autodesk.Revit.DB.FailureDefinitionRegistry.FindFailureDefinition(Autodesk.Revit.DB.FailureDefinitionId)
Finds a specific FailureDefinition by a given FailureDefinitionId.
id:
The id of the FailureDefinition.
Returns:
The accessor of the found FailureDefinition, or null, if the FailureDefinition was not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FailureDefinitionRegistry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FailureDefinitionRegistry
The global registry for all FailureDefinitions in the Revit session.
Remarks:
When a FailureDefinition is created, it will be registered in this registry automatically.
Registration is allowed only during Revit Application startup - after that FailureDefinitionRegistry is locked
and creation of new FailureDefinitions is not allowed.
There is only one instance of FailureDefinitionRegistry in session.
Autodesk.Revit.ApplicationServices.Application.GetFailureDefinitionRegistry
Since:
2011